EDT/УТ/src/Documents/ОтчетПоДСМП/ОтчетПоДСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоДСМП</name>
  <registerRecords>InformationRegister.СостояниеДСПриУдаленномЗакрытии</registerRecords>
  <attributes>
    <name>НомерМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МП</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкипажСогласенСДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДС</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СостояниеДСПриУдаленномЗакрытии/СостояниеДСПриУдаленномЗакрытии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеДСПриУдаленномЗакрытии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДСПринятыКассиром</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваров</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияУслуг</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваровНДС</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ОтчетПоДСМП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияПоРСЗаказыУдаленногоЗакрытияДС();
КонецПроцедуры

Процедура ДвиженияПоРСЗаказыУдаленногоЗакрытияДС()
	Движения.СостояниеДСПриУдаленномЗакрытии.Очистить();
	Движения.СостояниеДСПриУдаленномЗакрытии.Записывать = Истина;
	
	
	Зап = Новый Запрос;
	
	Зап.Текст =
	"ВЫБРАТЬ
	|	ПривязкаМашинКРейсам.Транспорт КАК Транспорт,
	|	МАКСИМУМ(ПривязкаМашинКРейсам.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_СрезТранспортПоРейсам
	|ИЗ
	|	РегистрСведений.ПривязкаМашинКРейсам КАК ПривязкаМашинКРейсам
	|ГДЕ
	|	ПривязкаМашинКРейсам.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПривязкаМашинКРейсам.Транспорт = &Транспорт
	|	И ПривязкаМашинКРейсам.Рейс.ДатаРейса = НАЧАЛОПЕРИОДА(&ДатаКон, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПривязкаМашинКРейсам.Транспорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс,
	|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
	|	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	|	ПривязкаМашинКРейсамСрезПоследних.Период КАК Период
	|ИЗ
	|	ВТ_СрезТранспортПоРейсам КАК ВТ_СрезТранспортПоРейсам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
	|		ПО ВТ_СрезТранспортПоРейсам.Транспорт = ПривязкаМашинКРейсамСрезПоследних.Транспорт
	|			И ВТ_СрезТранспортПоРейсам.Период = ПривязкаМашинКРейсамСрезПоследних.Период";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаРейса - 86400));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаРейса));
	Зап.УстановитьПараметр("Транспорт", Транспорт);
	
	ВыбРейс = Зап.Выполнить().Выбрать();
	ВыбРейс.Следующий();
	
	
	Зап.Текст =
	"ВЫБРАТЬ
	|	ОтчетПоДСМПДС.Заказ КАК Заказ,
	|	ОтчетПоДСМПДС.ТипОплаты КАК ТипОплаты,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетПоДСМПДС.ТипОплаты В (ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные), ЗНАЧЕНИЕ(Справочник.ТипыОплат.Терминал))
	|				ТОГДА ОтчетПоДСМПДС.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	Документ.ОтчетПоДСМП.ДС КАК ОтчетПоДСМПДС
	|ГДЕ
	|	ОтчетПоДСМПДС.Ссылка = &Док
	|	И ОтчетПоДСМПДС.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетПоДСМПДС.Заказ,
	|	ОтчетПоДСМПДС.ТипОплаты";
	Зап.УстановитьПараметр("Док", Ссылка);
	
	ВыбЗаказы = Зап.Выполнить().Выбрать();
	
	
	Пока ВыбЗаказы.Следующий() Цикл
		Нов = Движения.СостояниеДСПриУдаленномЗакрытии.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, ВыбРейс, "Рейс, Транспорт, Водитель");
		Нов.Период = Дата;
		Нов.Заказ = ВыбЗаказы.Заказ;
		Нов.ТипОплаты = ВыбЗаказы.ТипОплаты;
		Нов.СуммаДС = ВыбЗаказы.Сумма;
	КонецЦикла;	
КонецПроцедуры
